#### 📖 Terraform Plan ('infra/resources/dev') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # azurerm_api_management_api.to_do_api will be destroyed
  # (because azurerm_api_management_api.to_do_api is not in configuration)
  - resource "azurerm_api_management_api" "to_do_api" {
      - api_management_name   = "dx-d-itn-playground-pg-apim-01" -> null
      - api_type              = "http" -> null
      - description           = "To Do List API" -> null
      - display_name          = "To Do API" -> null
      - id                    = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/apis/to-do-api;rev=1" -> null
      - is_current            = true -> null
      - is_online             = false -> null
      - name                  = "to-do-api" -> null
      - path                  = "api/v1" -> null
      - protocols             = [
          - "https",
        ] -> null
      - resource_group_name   = "dx-d-itn-test-rg-01" -> null
      - revision              = "1" -> null
      - soap_pass_through     = false -> null
      - subscription_required = true -> null
        # (6 unchanged attributes hidden)

      - import {
          - content_format = "openapi" -> null
          - content_value  = <<-EOT
                openapi: 3.0.3
                info:
                  title: To Do List API
                  version: 0.0.0
                paths:
                
                  /info:
                    get:
                      operationId: info
                      responses:
                        '200':
                          description: Success
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ApplicationInfo'
                        '500':
                          description: Internal Server error
                
                components:
                  schemas:
                    ApplicationInfo:
                      type: object
                      properties:
                        name:
                          type: string
                        version:
                          type: string
                      required:
                        - name
                        - version
            EOT -> null
        }

      - subscription_key_parameter_names {
          - header = "Ocp-Apim-Subscription-Key" -> null
          - query  = "subscription-key" -> null
        }
    }

  # azurerm_api_management_backend.to_do_api_fn will be destroyed
  # (because azurerm_api_management_backend.to_do_api_fn is not in configuration)
  - resource "azurerm_api_management_backend" "to_do_api_fn" {
      - api_management_name = "dx-d-itn-playground-pg-apim-01" -> null
      - description         = "To Do List API" -> null
      - id                  = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/backends/to-do-api-azure-function" -> null
      - name                = "to-do-api-azure-function" -> null
      - protocol            = "http" -> null
      - resource_group_name = "dx-d-itn-test-rg-01" -> null
      - url                 = "https://dx-d-itn-playground-be-func-01.azurewebsites.net" -> null
        # (2 unchanged attributes hidden)
    }

  # module.function_app.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Web/sites/dx-d-itn-playground-be-func-01"
        name                                           = "dx-d-itn-playground-be-func-01"
        tags                                           = {
            "CostCenter"  = "TS700 - ENGINEERING"
            "CreatedBy"   = "Terraform"
            "Environment" = "Dev"
            "Owner"       = "DevEx"
            "Scope"       = "Dynatrace PoC"
        }
        # (32 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_path                             = "/info" -> "/api/info"
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.to_do_api.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "dx-d-itn-playground-pg-apim-01"
      + api_type              = (known after apply)
      + description           = "API to handle a To Do list"
      + display_name          = "To Do API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "To Do API"
      + path                  = "todo"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "dx-d-itn-test-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = <<-EOT
                openapi: 3.0.3
                info:
                  title: To Do List API
                  version: 0.0.0
                paths:
                
                  /info:
                    get:
                      operationId: info
                      responses:
                        '200':
                          description: Success
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ApplicationInfo'
                        '500':
                          description: Internal Server error
                
                components:
                  schemas:
                    ApplicationInfo:
                      type: object
                      properties:
                        name:
                          type: string
                        version:
                          type: string
                      required:
                        - name
                        - version
            EOT
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.to_do_api.azurerm_api_management_api_policy.to_do_api will be created
  + resource "azurerm_api_management_api_policy" "to_do_api" {
      + api_management_name = "dx-d-itn-playground-pg-apim-01"
      + api_name            = "To Do API"
      + id                  = (known after apply)
      + resource_group_name = "dx-d-itn-test-rg-01"
      + xml_content         = <<-EOT
            <policies>
              <inbound>
                <base />
                <set-backend-service backend-id="to-do-api-azure-function" />
                <!-- Append `api/` to the path before invoking the backend -->
                <rewrite-uri template='@(System.String.Concat("api/", context.Request.Url.Path))' />
                <cors>
                  <allowed-origins>
                      <origin>*</origin>
                  </allowed-origins>
                  <allowed-methods>
                      <method>*</method>
                  </allowed-methods>
                  <allowed-headers>
                      <header>*</header>
                  </allowed-headers>
                  <expose-headers>
                      <header>*</header>
                  </expose-headers>
                </cors>
              </inbound>
              <outbound>
                <base />
              </outbound>
              <backend>
                <base />
              </backend>
              <on-error>
                <base />
              </on-error>
            </policies>
        EOT
    }

  # module.to_do_api.azurerm_api_management_backend.backend will be created
  + resource "azurerm_api_management_backend" "backend" {
      + api_management_name = "dx-d-itn-playground-pg-apim-01"
      + description         = "API to handle a To Do list"
      + id                  = (known after apply)
      + name                = "to-do-api-azure-function"
      + protocol            = "http"
      + resource_group_name = "dx-d-itn-test-rg-01"
      + url                 = "https://dx-d-itn-playground-be-func-01.azurewebsites.net"
    }

Plan: 3 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
